In [1]:
import pandas as pd

### Add Column/ Update Column

In [2]:
friend_dict_list = [
        {'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

### Add New Column with default value

In [6]:
df['salary'] = None
df

    name  age        job salary
0   Jone   15    student   None
1  Jenny   30  developer   None
2   Nate   30    teacher   None

### Add New Column derived from existing value
유래하다, 파생하다.

In [8]:
friend_list = [
               'name':['Jone', 15, 'student'],
               'age':['Jenny', 30, 'developer'],
               'job':['Nate', 30, 'teacher']
               ]
column_name = ['name', 'age', 'job']
df = pd.DataFrame(friend_list, columns = column_name )
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

### one liner adding column by true or false condition
컬럼 생성시, 넘파이의 where()fmf dldydgkdu 내부에 bool조건으로 replace조건을 부여함.

In [8]:
import numpy as np
df['salary'] = np.where(df['job'] != 'student' , 'yes', 'no')

In [9]:
df

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [30]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
                    {'name': 'Jenny', 'midterm': 85, 'final': 80},
                    {'name': 'Nate', 'midterm': 10, 'final': 30}]

df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

### column derived from adding two existing columns
기존 두 개의 컬럼을 이요하여 하나의 컬럼을 만드는 작업

In [31]:
df['total'] = df['midterm'] + df['final']
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

In [32]:
# total 컬럼을 넣었으면 average 컬럼도 넣어야지?!
df['average'] = df['total']/2

### column by conditional condition 
조건절을 이용한 컬럼 생성

In [33]:
df['average']

0    90.0
1    82.5
2    20.0
Name: average, dtype: float64

In [34]:
grade = []
for row in df['average']: # 만약 if,elf의 순서가 바뀌면 문제 발생.
    if row >= 90:
        grade.append('A')
    elif row >= 80: 
        grade.append('B')
    elif row >= 70: 
        grade.append('C')
    else: 
        grade.append('F')

df['grade'] = grade

In [35]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       10     30     40     20.0     F

## 판다스의 apply를 사용하기    
우선 함수 사용

In [36]:
def pass_or_fail(row):
    if row != 'F':
        return 'Pass'
    else: 
        return 'Fail'

In [39]:
df.grade = df.grade.apply(pass_or_fail) 
# 기존에 있는 녀석을 수정할 때

# df['grade'] = df.grade.apply(pass_or_fail)
# 기존에 없는 칼럼을 추가 할때 사용.

In [40]:
df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       10     30     40     20.0  Pass

### info extraction using df.apply

In [80]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [81]:
def extract_year(row):
    return row.split('-')[0]
def extract_month(row):
    return row.split('-')[1]
def extract_day(row):
    return row.split('-')[2]

In [84]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df.head()

   yyyy-mm-dd day  year
0  2000-06-27  27  2000
1  2002-09-24  24  2002
2  2005-12-20  20  2005

### passing keyword parameter to apply function 
you also can send parameter to apply function

In [85]:
def extract_year(year, current_year):
    return current_year - int(year)
df['age'] = df.year.apply(extract_year, current_year = 2020)
df

   yyyy-mm-dd day  year  age
0  2000-06-27  27  2000   20
1  2002-09-24  24  2002   18
2  2005-12-20  20  2005   15

### passing multiple keyword parameter to apply function
you also can send multiple parameter to apply function

In [86]:
def get_introduce(age, prefix, suffix): #prefix접두사,suffix접미사
    return prefix + str(age) + suffix

In [88]:
df['introduce'] = df.age.apply(get_introduce, prefix = 'I am',suffix = ' years old')
df

   yyyy-mm-dd day  year  age         introduce
0  2000-06-27  27  2000   20  I am20 years old
1  2002-09-24  24  2002   18  I am18 years old
2  2005-12-20  20  2005   15  I am15 years old

### passing multiple columns to apply function
you can provide axis=1 in the apply function, so you send all column values to apply function

In [90]:
def get_introduce2(row):
    return ' I was born in '+str(row.year)+' my age is '+str(row.age)
df.introduce = df.apply(get_introduce2, axis=1)
df

   yyyy-mm-dd day  year  age                         introduce
0  2000-06-27  27  2000   20   I was born in 2000 my age is 20
1  2002-09-24  24  2002   18   I was born in 2002 my age is 18
2  2005-12-20  20  2005   15   I was born in 2005 my age is 15

### how to use map function
if you give function as parameter, it works same as apply function on the column

In [98]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [99]:
def extract_year(row):
    return row.split('-')[0]

In [100]:
df['year'] = df['yyyy-mm-dd'].map(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [102]:
job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [103]:
df.job = df.job.map({"student":1,"developer":2,"teacher":3})
df

   age  job
0   20    1
1   30    2
2   30    3

### Applymap
update all elements in the dataframe at once

In [105]:
x_y = [{'x': 5.5, 'y': -5.6},
         {'x': -5.2, 'y': 5.5},
         {'x': -1.6, 'y': -4.5}]
df = pd.DataFrame(x_y)
df

     x    y
0  5.5 -5.6
1 -5.2  5.5
2 -1.6 -4.5

In [106]:
df = df.applymap(np.around) # numpy의 around속성 사용 소수점을 0으로 만들어 버림.
df

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0

### Add Row

In [107]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [113]:
df2 = pd.DataFrame([
                    ['Ben',50,50]], 
                    columns = ['name','midterm','final'])
df2

  name  midterm  final
0  Ben       50     50

In [117]:
df = df.append(df2, ignore_index = True)
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30
3    Ben       50     50

In [74]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [75]:
df2 = pd.DataFrame([
    ['Ben',50,50]
                ],columns = ['name','midterm','final'])

In [76]:
df2.head()

  name  midterm  final
0  Ben       50     50

In [79]:
# 기존 df <---df2를 삽입하려고 할 떄는 append를 사용한다. 
df.append(df2)
# 문제점은 추가된 row가 index0부터 잡히게 된다. 아래 방법 확인

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30
0    Ben       50     50

In [ ]:
# 말그대로 index를 무시하고 기존 df의 인덱스를 이어서 4로 index값이 부여됨.
df.append(df2,ignore_index=True)